//
//  Game.swift
//  BaseballGame
//
//  Created by 변예린 on 1/13/26.
//

import Foundation

// struct로 할건지 class로 할건지?
// 2. Lv2 `01/14 까지`
//- [ ]  정답을 맞추기 위해 3자리수를 입력하고 힌트를 받습니다
//    - [ ]  힌트는 야구용어인 **볼**과 **스트라이크**입니다.
//    - [ ]  같은 자리에 같은 숫자가 있는 경우 **스트라이크**, 다른 자리에 숫자가 있는 경우 **볼**입니다
//    - ex) 정답 : 456 인 경우
//        - 435를 입력한 경우 → 1스트라이크 1볼
//        - 357를 입력한 경우 → 1스트라이크
//        - 678를 입력한 경우 → 1볼
//        - 123를 입력한 경우 → Nothing
//    - 만약 올바르지 않은 입력값에 대해서는 오류 문구를 보여주세요
//- 3자리 숫자가 정답과 같은 경우 게임이 종료됩니다


class BaseballGame {
    var answer: [Int] = []
    
    // 정답 생성 함수
    func setAnswer() {
        for _ in 0...2 {
            answer.append(Int.random(in: 1...9))
        }
    }
}
